; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v2 - type_1 ?v7 - type_3)
 	      (pred_3 ?v8 - object ?v7 - type_3)
	      (pred_2 ?v2 - type_1 ?v5 - type_2)
	      (pred_4 ?v2 - type_1 ?v8 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v3 ?v4 - type_3)
       :precondition (and  (pred_1 ?v2 ?v3))
       :effect (and  (pred_1 ?v2 ?v4)
		     (not (pred_1 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_1 ?v1 - object ?v6 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v6) (pred_1 ?v2 ?v6) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v2 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_1 ?v1 - object ?v6 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v5) (pred_1 ?v2 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_2 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_07 obj_05 - type_2
obj_01 obj_03 obj_10 obj_06 - type_3
obj_02 obj_09 obj_04 - object)
(:init
(pred_1 obj_08 obj_03)
(pred_2 obj_08 obj_07)
(pred_2 obj_08 obj_05)
(pred_3 obj_02 obj_06)
(pred_3 obj_09 obj_06)
(pred_3 obj_04 obj_03)
)
(:goal
(and
(pred_3 obj_02 obj_06)
(pred_3 obj_09 obj_03)
(pred_3 obj_04 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_08 ?b obj_05))))
)
)

; plan
1. (op_3 obj_08 obj_04 obj_03 obj_07)
   deleted: (pred_3 obj_04 obj_03) (pred_2 obj_08 obj_07)
   added: (pred_4 obj_08 obj_04 obj_07)
   goals met: 1 of 3
2. (op_2 obj_08 obj_03 obj_01)
   deleted: (pred_1 obj_08 obj_03)
   added: (pred_1 obj_08 obj_01)
   goals met: 1 of 3
3. (op_1 obj_08 obj_04 obj_01 obj_07)
   deleted: (pred_4 obj_08 obj_04 obj_07)
   added: (pred_3 obj_04 obj_01) (pred_2 obj_08 obj_07)
   goals met: 2 of 3
4. (op_2 obj_08 obj_01 obj_06)
   deleted: (pred_1 obj_08 obj_01)
   added: (pred_1 obj_08 obj_06)
   goals met: 2 of 3
5. (op_3 obj_08 obj_09 obj_06 obj_07)
   deleted: (pred_3 obj_09 obj_06) (pred_2 obj_08 obj_07)
   added: (pred_4 obj_08 obj_09 obj_07)
   goals met: 2 of 3
6. (op_2 obj_08 obj_06 obj_03)
   deleted: (pred_1 obj_08 obj_06)
   added: (pred_1 obj_08 obj_03)
   goals met: 2 of 3
7. (op_1 obj_08 obj_09 obj_03 obj_07)
   deleted: (pred_4 obj_08 obj_09 obj_07)
   added: (pred_3 obj_09 obj_03) (pred_2 obj_08 obj_07)
   goals met: 3 of 3
